In [1]:
import numpy as np
import pandas as pd
s1 = pd.Series(np.random.randint(1,101,9),
          index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
                       [1, 2, 3, 1, 2, 3, 1, 2, 3]])
s1.index.names= ['x','y']

In [2]:
s1['a']
display(s1)

x  y
a  1     74
   2     11
   3     10
b  1     30
   2     24
c  3     98
   1     64
d  2     53
   3    100
dtype: int64

In [3]:
s2 = s1.unstack(level='x')
s2

x     a     b     c      d
y
1  74.0  30.0  64.0    NaN
2  11.0  24.0   NaN   53.0
3  10.0   NaN  98.0  100.0

In [4]:
s2

x     a     b     c      d
y
1  74.0  30.0  64.0    NaN
2  11.0  24.0   NaN   53.0
3  10.0   NaN  98.0  100.0

In [5]:
s3 = s2.stack()
s3

y  x
1  a     74.0
   b     30.0
   c     64.0
2  a     11.0
   b     24.0
   d     53.0
3  a     10.0
   c     98.0
   d    100.0
dtype: float64

In [6]:
s3.swaplevel().sort_index(level='x')

x  y
a  1     74.0
   2     11.0
   3     10.0
b  1     30.0
   2     24.0
c  1     64.0
   3     98.0
d  2     53.0
   3    100.0
dtype: float64